const cities = [
    "Αθήνα", "Θεσσαλονίκη", "Πάτρα", "Ηράκλειο", "Λάρισα", "Βόλος", "Ιωάννινα", "Καβάλα", "Ρόδος",
    "Σπάρτη", "Κομοτηνή", "Χανιά", "Λαμία", "Χαλκίδα", "Τρίπολη", "Σέρρες", "Μυτιλήνη", "Κόρινθος",
    "Αμαλιάδα", "Κατερίνη", "Αλεξανδρούπολη", "Κοζάνη", "Πύργος", "Σέρρες", "Αγρίνιο", "Δράμα", "Βέροια",
    "Ρέθυμνο", "Κέρκυρα", "Πρέβεζα", "Καρδίτσα", "Γιαννιτσά", "Ξάνθη", "Καλαμάτα", "Άργος", "Πολύμηλος",
    "Πτολεμαΐδα", "Ναύπλιο", "Χίος", "Κιλκίς", "Βέροια", "Καισαριανή", "Ελευσίνα", "Πειραιάς", "Περιστέρι",
    "Καλλιθέα", "Αχαρνές", "Μαρούσι", "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Πάτρα", "Καλλιθέα", "Λάρισα",
    "Ζωγράφος", "Ηράκλειο", "Θεσσαλονίκη", "Περιστέρι", "Ηλιούπολη", "Χαλάνδρι", "Μαρούσι", "Αγία Δημητρίου",
    "Καλαμαριά", "Νίκαια", "Γλυφάδα", "Βύρωνας", "Αγία Παρασκευή", "Γαλάτσι", "Αιγάλεω", "Πετρούπολη",
    "Σέρρες", "Δράμα", "Κοζάνη", "Καρδίτσα", "Αλεξανδρούπολη", "Θεσσαλονίκη", "Κατερίνη", "Λαμία", "Τρίπολη",
    "Σπάρτη", "Κόρινθος", "Κομοτηνή", "Χανιά", "Λάρισα", "Βόλος", "Ιωάννινα", "Καβάλα", "Ρόδος", "Ηράκλειο",
    "Πάτρα", "Θεσσαλονίκη", "Αθήνα", "Πειραιάς", "Λάρισα", "Καλλιθέα", "Νίκαια", "Περιστέρι", "Χερσόνησος",
    "Μύκονος", "Κομοτηνή", "Καβάλα", "Χαλκίδα", "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία",
    "Κατερίνη", "Αγρίνιο", "Σέρρες", "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι",
    "Καλλιθέα", "Αχαρνές", "Μαρούσι", "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος",
    "Μυτιλήνη", "Καβάλα", "Χαλκίδα", "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη",
    "Αγρίνιο", "Σέρρες", "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα",
    "Αχαρνές", "Μαρούσι", "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη",
    "Καβάλα", "Χαλκίδα", "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο",
    "Σέρρες", "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές",
    "Μαρούσι", "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη", "Καβάλα",
    "Χαλκίδα", "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο", "Σέρρες",
    "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές", "Μαρούσι",
    "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη", "Καβάλα", "Χαλκίδα",
    "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο", "Σέρρες",
    "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές", "Μαρούσι",
    "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη", "Καβάλα", "Χαλκίδα",
    "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο", "Σέρρες",
    "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές", "Μαρούσι",
    "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη", "Καβάλα", "Χαλκίδα",
    "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο", "Σέρρες",
    "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές", "Μαρούσι",
    "Νέα Ιωνία", "Γλυφάδα", "Ηράκλειο", "Καλαμαριά", "Πύργος", "Μυτιλήνη", "Καβάλα", "Χαλκίδα",
    "Χανιά", "Πέτρα", "Ρέθυμνο", "Κομοτηνή", "Λαμία", "Κατερίνη", "Αγρίνιο", "Σέρρες",
    "Αλεξανδρούπολη", "Ξάνθη", "Κοζάνη", "Πειραιάς", "Περιστέρι", "Καλλιθέα", "Αχαρνές", "Μαρούσι",
    "Νέα Ιωνία", "Γλυφάδα"
]

function filter(arr) {
    const uniqueValues = Array.from(new Set(arr));
    return uniqueValues.sort();
}

const uniqueCities = filter(cities);
const citySelect = document.getElementById("city");

uniqueCities.forEach(city => {

    const option = document.createElement("option");
    option.text = city;
    option.value = city;
    if (citySelect.getAttribute('currentLoc') == city) {
        option.setAttribute('selected', 'selected');
    }
    citySelect.appendChild(option);
});